<a href="https://colab.research.google.com/github/Um4462bz/DSCI_210_R_notebooks/blob/main/lecture_6_1_introduction_to_dplyr_and_tidyr.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Part 1 - Introduction to the `tidyverse` in `R`

## Why use R?


- Save and rerun code
- Several data science/statistics packages available
- Great graphics
- Built for data
- Free and open-source
- Large user community

### Market-share

![](https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/Fig-1a-IndeedJobs-2017.png?raw=1)

## What is the `tidyverse`?

The tidyverse is a collection of `R` packages designed for data science. They all share an underlying design philosophy, grammar, and data structures. We will focus on a few packages for managing data, using the data verb syntax.
*   `dplyr` (`select`, `filter`, `mutate`, `group_by`, `summarize`)
* `tidyr` (stack and unstack with `gather` and `spread`)


In future data science courses, you will likely use `ggplot`  to create nice graphics.

# Introduction to the `dplyr` package in `R`

## Loading a Library

In [5]:
# This loads all of the dplyr functions
# You must do every time you start new R session

library("dplyr")

## Reading in data

In [6]:
surveys <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/portal_data_joined.csv')

# Good habit: Always inspect the result with head
head(surveys,n=10)

   record_id month day year plot_id species_id sex hindfoot_length weight
1    1        7    16  1977 2       NL         M   32               NA
2   72        8    19  1977 2       NL         M   31               NA
3  224        9    13  1977 2       NL             NA               NA
4  266       10    16  1977 2       NL             NA               NA
5  349       11    12  1977 2       NL             NA               NA
6  363       11    12  1977 2       NL             NA               NA
7  435       12    10  1977 2       NL             NA               NA
8  506        1     8  1978 2       NL             NA               NA
9  588        2    18  1978 2       NL         M   NA              218
10 661        3    11  1978 2       NL             NA               NA
   genus   species  taxa   plot_type
1  Neotoma albigula Rodent Control
2  Neotoma albigula Rodent Control
3  Neotoma albigula Rodent Control
4  Neotoma albigula Rodent Control
5  Neotoma albigula Rodent Control
6  Neotoma albigula Rodent Control
7  Neotoma albigula Rodent Control
8  Neotoma albigula Rodent Control
9  Neotoma albigula Rodent Control
10 Neotoma albigula Rodent Control

## Selecting columns with `select`

In [8]:
# Syntax: select(df, col1, col2, ...)

new_df <- select(surveys, plot_id, species_id, weight)
head(new_df)

  plot_id species_id weight
1 2       NL         NA
2 2       NL         NA
3 2       NL         NA
4 2       NL         NA
5 2       NL         NA
6 2       NL         NA

## Filtering rows with `filter`

In [9]:
new_df2 <- filter(surveys, year == 1995)
head(new_df2)

  record_id month day year plot_id species_id sex hindfoot_length weight
1 22314      6     7  1995 2       NL         M   34               NA
2 22728      9    23  1995 2       NL         F   32              165
3 22899     10    28  1995 2       NL         F   32              171
4 23032     12     2  1995 2       NL         F   33               NA
5 22003      1    11  1995 2       DM         M   37               41
6 22042      2     4  1995 2       DM         F   36               45
  genus     species  taxa   plot_type
1 Neotoma   albigula Rodent Control
2 Neotoma   albigula Rodent Control
3 Neotoma   albigula Rodent Control
4 Neotoma   albigula Rodent Control
5 Dipodomys merriami Rodent Control
6 Dipodomys merriami Rodent Control

*Question: Why are the columns not selected up above still appearing here?*

## Creating a new column with `mutate`

In [10]:
new_df <- select(surveys, plot_id, species_id, weight, year)
new_df2 <- filter(new_df, year == 1995)
new_df3 <- mutate(new_df2, weight_kg = weight / 1000)
head(new_df3)

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

In [11]:
# To drop the old weight column:

new_df4 <- select(new_df3, -weight)
head(new_df4)

  plot_id species_id year weight_kg
1 2       NL         1995    NA
2 2       NL         1995 0.165
3 2       NL         1995 0.171
4 2       NL         1995    NA
5 2       DM         1995 0.041
6 2       DM         1995 0.045

## Motivating pipes

The pipe, `%>%`, is a powerful tool for clearly expressing a sequence of multiple operations. Before we explore using the pipe with `dplyr` functions, let's look at some alternatives.

### Alternative #1: Imperative coding pattern - save, save, save!


<img width="450" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/imperative_pattern.png?raw=1">

This works, but it's not the best approach.
- **Problem 1:** Creates lots of temporary variables 
- **Problem 2:** Messy and lots of overhead

All the extra *stuff* clouds the meaning/intent of the code!

### Alternative #2 - Rewrite to the same data frame

Instead of creating new objects at each step, we could just overwrite the original:

```{R}
surveys <- select(surveys, plot_id, species_id, weight, year)
surveys <- filter(surveys, year == 1995)
surveys <- mutate(surveys, weight_kg = weight / 1000)
```

**Problem:** This approach obscures what's changing on each line.

### Alternative #3 - Functional coding approach

This approach just strings the function calls together:

In [12]:
surveys2 <-
select(
  filter(
    mutate(surveys,
      weight_kg = weight / 1000), 
    year == 1995), 
  plot_id, species_id, weight, year)
  head(surveys)

  record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7    16  1977 2       NL         M   32              NA
2  72        8    19  1977 2       NL         M   31              NA
3 224        9    13  1977 2       NL             NA              NA
4 266       10    16  1977 2       NL             NA              NA
5 349       11    12  1977 2       NL             NA              NA
6 363       11    12  1977 2       NL             NA              NA
  genus   species  taxa   plot_type
1 Neotoma albigula Rodent Control
2 Neotoma albigula Rodent Control
3 Neotoma albigula Rodent Control
4 Neotoma albigula Rodent Control
5 Neotoma albigula Rodent Control
6 Neotoma albigula Rodent Control

**Problem:** We have to read from inside-out and from right to left. This is difficult to understand!

### The fix: use a pipe for cleaner code

The pipe helps us write code in a way that is easier to read and understand. The pipe pushes the data frame through the first position:

<img width="350" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/pipe1.png?raw=1">

Imagine an invisible data frame in the first spot... but don't write it!

<img width="350" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/pipe2.png?raw=1">

Note this important point - each data frame is NEW when you use the pipe.

\\

### The code with pipes - much cleaner!
The code shown below uses the pipe with `dplyr` functions. The advantage is that we are now focusing on the data verbs!

In [15]:
surveys  %>% 
  select(plot_id, species_id, weight, year) %>%
  filter(year == 1995) %>%
  mutate(weight_kg = weight / 1000) %>%
  head()

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

### My preferred code format

In [16]:
(surveys  
 %>% select(plot_id, species_id, weight, year) 
 %>% filter(year == 1995) 
 %>% mutate(weight_kg = weight / 1000) 
 %>% head()
)

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

## <font color="red"> Exercise 1 </font>

Write code using `dplyr` with pipes to perform the following tasks.

1. Compute the weight of all species in lbs.
2. Filter out the rows containing only weights (in lbs) greater than 0.2 lbs.

In [17]:
# Your code for 1 here
surveys %>% mutate(weigth_lbs = weight*.002205) %>% head

  record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7    16  1977 2       NL         M   32              NA
2  72        8    19  1977 2       NL         M   31              NA
3 224        9    13  1977 2       NL             NA              NA
4 266       10    16  1977 2       NL             NA              NA
5 349       11    12  1977 2       NL             NA              NA
6 363       11    12  1977 2       NL             NA              NA
  genus   species  taxa   plot_type weigth_lbs
1 Neotoma albigula Rodent Control   NA
2 Neotoma albigula Rodent Control   NA
3 Neotoma albigula Rodent Control   NA
4 Neotoma albigula Rodent Control   NA
5 Neotoma albigula Rodent Control   NA
6 Neotoma albigula Rodent Control   NA

In [3]:
# Your code for task 2 here
surveys %>% mutate(weight_lbs =*.002205)

\\
# Part 2 - Converting code and types of errors

## You've seen piping before...
 
<img width="850" src="https://github.com/thooks630/DSCI_210_R_notebooks/raw/main/img/openrefine_piping.PNG">

## Saving the result of a piped operation

In [19]:
surveys_small <- 
(surveys 
  %>% filter(weight < 5) 
  %>% select(species_id, sex, weight)
)

head(surveys_small)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

## A recap - the advantages of piping

* Reads left-to-right
* Reads top-to-bottom
* Focuses on verbs
* Removes pointless nouns

## Comparing three different coding approaches

* Imperative
* Functional
* Piping

### Imperative:

In [20]:
x <- pi
r_x <- round(x, 2)
c_x <- as.character(r_x)
c_x

[1] "3.14"

### Functional:

In [21]:
as.character(round(pi,2))

[1] "3.14"

### Piping:

In [22]:
pi %>%
  round(2) %>%
  as.character

[1] "3.14"

## Example 1 - converting to pipes

In [23]:
surveys_small <- filter(surveys, weight < 5) 
survey_small_id_sex_wgt <- select(surveys_small, species_id, sex, weight)
head(survey_small_id_sex_wgt)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [24]:
# Convert to piped code
surveys %>%
filter(weight < 5) %>%
select(species_id, sex, weight) %>%
head

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

## Example 2 - converting to imperative approach

In [25]:
surveys_small <- surveys %>%
  filter(species_id == 'NL') %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 NL         M   NA
2 NL         M   NA
3 NL             NA
4 NL             NA
5 NL             NA
6 NL             NA

In [26]:
# Convert to imperative
surveys_small <- filter(surveys, species_id == "NL")
surveys_small2 <- select(surveys_small, species_id, sex, weight)
head(surveys_small2)

  species_id sex weight
1 NL         M   NA
2 NL         M   NA
3 NL             NA
4 NL             NA
5 NL             NA
6 NL             NA

## Example 3 - converting to functional approach

In [27]:
surveys_small <- surveys %>%
  filter(weight < 5) %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [28]:
# Convert to functional
head(select(filter(surveys, weight < 5), species_id, sex, weight))

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

## <font color="red"> Exercise 2 </font>

Perform each of the following code conversions.

In [29]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

#### <font color="red">TASK 1</font>. Convert the following *piped code* to the *imperative style*

In [32]:
sales %>%
    select(Salesperson, Compact, Sedan) %>%
    mutate(Car = Compact + Sedan)

  Salesperson Compact Sedan Car
1 Ann         22      18    40
2 Bob         19      12    31
3 Yolanda     19       8    27
4 Xerxes      12      23    35

In [42]:
# Your code here (using imperative approach)
slases2 = select(sales, Salesperson, Compact, Sedan)
slases3 = mutate(slases2, Car = Compact + Sedan)
head(slases3)

  Salesperson Compact Sedan Car
1 Ann         22      18    40
2 Bob         19      12    31
3 Yolanda     19       8    27
4 Xerxes      12      23    35

#### <font color="red">TASK 2</font>. Convert the following *imperative code* to the *piped style*

In [39]:
df2 <- mutate(sales, Car = Compact + Sedan)
df3 <- mutate(df2, Utility = SUV + Truck)
df4 <- select(df3, Salesperson, Car, Utility)
head(df4)

  Salesperson Car Utility
1 Ann         40  27
2 Bob         31  37
3 Yolanda     27  47
4 Xerxes      35  27

In [38]:
# Your code here
sales %>%
    mutate(sales, Car = Compact + Sedan) %>%
    mutate( Utility = SUV + Truck) %>%
    select( Salesperson, Car, Utility) %>%
    head

  Salesperson Car Utility
1 Ann         40  27
2 Bob         31  37
3 Yolanda     27  47
4 Xerxes      35  27

## Types of programming errors

* Name errors
* Syntax errors
* Semantic errors (hardest/worst)

### Name Errors - Using the wrong name

In [43]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

In [44]:
# Find the name errors
sales %>%
  select(Salesperson, sedan) #sedan should be Sedan

ERROR: ignored

### Syntax errors - Incorrect syntax

In [45]:
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

In [47]:
# Find the syntax errors
sales %>%
  mutate(monthly_sedan = Sedan/3 #there should be a comma in this line
         monthly_suv = SUV/3,
         monthly_truck = Truck/3)

ERROR: ignored

### Semantic Errors - Correct code, wrong meaning

In [ ]:
# Find the semantic errors
sales %>%
  group_by(Salesperson) %>%
  mutate(avg_sedan = median(Truck))

## <font color="red"> Exercise 3 </font>

Identify all of the errors in the following code and classify each as either a name, syntax, or semantic error.

In [49]:
sales %>%
    mutate(Car = compact + sedan) %>%
    mutate(Utility = SUV * Truck)

ERROR: ignored

In [ ]:
#Last line is missing a ')' and has extra '%>%' at the end